{"media":{"disableImageZooming":false},"taskDescription":"<p>Fill all the gaps in blue by clicking-and-holding a concept in a grey box and draging it into its corresponding definition.&nbsp;Beware that not all concepts have a matching definition!<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>When done, (scroll down to) click the “Check” button.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>Tip: Instead of drag-and-drop, you can also click on a concept and then click on the gap where you want to place it.<\/p>\n","overallFeedback":[{"from":0,"to":49,"feedback":"Keep trying!"},{"from":50,"to":70,"feedback":"Well enough!"},{"from":71,"to":89,"feedback":"Almost there!"},{"from":90,"to":100,"feedback":"You got it!"}],"checkAnswer":"Check","submitAnswer":"Submit","tryAgain":"Retry","showSolution":"Show solution","dropZoneIndex":"Drop Zone @index.","empty":"Drop Zone @index is empty.","contains":"Drop Zone @index contains draggable @draggable.","ariaDraggableIndex":"@index of @count draggables.","tipLabel":"Show tip","correctText":"Correct!","incorrectText":"Incorrect!","resetDropTitle":"Reset drop","resetDropDescription":"Are you sure you want to reset this drop zone?","grabbed":"Draggable is grabbed.","cancelledDragging":"Cancelled dragging.","correctAnswer":"Correct answer:","feedbackHeader":"Feedback","behaviour":{"enableRetry":true,"enableSolutionsButton":false,"enableCheckButton":true,"instantFeedback":false},"scoreBarLabel":"You got :num out of :total points","a11yCheck":"Check the answers. The responses will be marked as correct, incorrect, or unanswered.","a11yShowSolution":"Show the solution. The task will be marked with its correct solution.","a11yRetry":"Retry the task. Reset all responses and start the task over again.","textField":"*Question Pool*: A container of questions that can be added to an e-exam in order to randomly display to each student a subset of those questions.\n\n*E-exam*: Refers to an exam, examination or (summative) assessment that is provided to the students in an electronic format, that is, with the usage of computers and internet. Can also be called “e-examination”. When referring to the creation of an e-exam on CLMS, it can also be referred as a “Quiz”.\n\n*Automatic Evaluation*: It refers to question types such as Multiple Choice, Multiple Answer, Matching, Kprime, and Ordering where the grade for each submitted answer is automatically determined by the platform based on criteria pre-determined by the question creator.\n\n*Registrar*: An official or department in charge of maintaining students&#039; records and information such as the modules and grades from each student.\n\n*CLMS*: The LMS developed by Constructor Tech from the Constructor Group. The &quot;C&quot; stands for Constructor. It&#039;s on this platform where e-exams are created and grades can be accessed.\n\n*Question title (textbox)*: Can be used to refer to the question in an abbreviated manner (e.g. “Python-final-q01”) in order to facilitate its retrieval when adding it to an e-exam or Question Pool. This piece of information will not be shown to the students.\n\n*Team*: In CLMS, a virtual space in the Management Portal of where only the members of that virtual space can access the contents (e.g. Quizzes, Questions) stored in there.","distractors":"*LMS* *Quizzes* *Manual Evaluation* *Proctor*"}