{"media":{"disableImageZooming":false},"taskDescription":"<p>Drag the concepts in gray boxes into their corresponding definition. When done, (scroll) to the end of this activtiy and click on \"Check\".<\/p>\n\n<p><br>\nSome concepts have already been paired to their correct definition.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>Tip: in order you to reach gaps at the bottom, you can<\/p>\n\n<ol>\n\t<li>zoom out your browser page by pressing the cmd\/control and \"minus\" keys, or<\/li>\n\t<li>drag a concept to a visible gap, scroll down, and move the concept further down.<\/li>\n<\/ol>\n\n<hr>\n<p>&nbsp;<\/p>\n","overallFeedback":[{"from":0,"to":49,"feedback":"Keep trying!"},{"from":50,"to":70,"feedback":"Well enough!"},{"from":71,"to":89,"feedback":"Almost there! You have mastered most of the general concepts about e-exams"},{"from":90,"to":100,"feedback":"You got it! You have mastered the general concepts about e-exams"}],"checkAnswer":"Check","submitAnswer":"Submit","tryAgain":"Retry","showSolution":"Show solution","dropZoneIndex":"Drop Zone @index.","empty":"Drop Zone @index is empty.","contains":"Drop Zone @index contains draggable @draggable.","ariaDraggableIndex":"@index of @count draggables.","tipLabel":"Show tip","correctText":"Correct!","incorrectText":"Incorrect!","resetDropTitle":"Reset drop","resetDropDescription":"Are you sure you want to reset this drop zone?","grabbed":"Draggable is grabbed.","cancelledDragging":"Cancelled dragging.","correctAnswer":"Correct answer:","feedbackHeader":"Feedback","behaviour":{"enableRetry":true,"enableSolutionsButton":true,"enableCheckButton":true,"instantFeedback":false},"scoreBarLabel":"You got :num out of :total points","a11yCheck":"Check the answers. The responses will be marked as correct, incorrect, or unanswered.","a11yShowSolution":"Show the solution. The task will be marked with its correct solution.","a11yRetry":"Retry the task. Reset all responses and start the task over again.","textField":"*Module*: Term used in Constructor University for referring to a class, course or subject.\n\n*LMS*: Stands for Learning Management System and it refers to an internet-based software application used for educational purposes. Such platform allows users to create and access educational contents and activities in courses.\n\n*C-LMS*: The LMS developed by Constructor Tech from the Constructor Group. The “C” stands for Constructor.\n\n*Remote*: In the context of this training, it refers to an examination where students are not required to be present in the same physical space (such as a classroom) in order to present an exam.\n\nOnline: In the context of this training, it refers to an examination that takes place using an internet-based platform. See “e-exam”.\n\n*E-exam*: Refers to an exam, examination or (summative) assessment that is provided to the students in an electronic format, that is, with the usage of computers and internet. When referring to the creation of an e-exam on C-LMS, it can also be referred as a “Quiz”.\n\nProctor: In the context of this training, it refers to the person who supervises students during an (e-)exam.\n\n*Makeup exam*: refers to the 2nd\/3rd attempt a student has after failing or not being able to do an exam for the first time.\n\n*Registrar*: An official or department in charge of maintaining students’ records and information such as the modules and grades from each student.\n\nDEU: Stands for Digital Education Unit and is a team composed of Learning Designers, Multimedia Producers and Project Managers who supports Faculty in the development of modules for Online Programs as well as other tasks related to the usage of digital products for teaching and learning purposes."}